norbiciat04/hoverboard_STM32F469I-DISCO/hoverboard_firmware_sw4/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2018 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f4xx_hal.h"

/* USER CODE BEGIN Includes */

#include <stdio.h>
#include <math.h>
#include "BLDC_Motors.h"
#include "tm_stm32_mpu6050.h"
#include "tm_stm32_delay.h"
#include "matrix.h"
#include "kalman_filter.h"
#include "PID_regulator.h"
#include "tensometer.h"

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c1;

TIM_HandleTypeDef htim6;
TIM_HandleTypeDef htim12;

UART_HandleTypeDef huart3;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
uint8_t allow = 0;
uint8_t Received[4] = "0";
uint8_t receive;
uint8_t rec_i = 0;
uint8_t temp_char[3];

//////////////////////Temporary
float kal_result = 0;
float angle = 0;		//before kalman
int32_t d_kal_result = 0;
int32_t d_angle = 0;		//before kalman

int8_t pid = 0;
uint32_t tenso = 0;
uint32_t co = 0;

TM_MPU6050_t MPU6050_Data0;


//temporary for tuning PID and Kalman
uint8_t Kp_t;                 // (P)roportional Tuning Parameter
uint8_t Ki_t;					// (I)ntegral Tuning Parameter
uint8_t Kd_t;					// (D)erivative Tuning Parameter

//uint8_t std_dev_v_t = std_dev_v;
//uint8_t std_dev_w_t = std_dev_w;
//Temporary

////////////////////////Temporary

//temporary for tuning PID and Kalman
extern float Kp;                 // (P)roportional Tuning Parameter
extern float Ki;					// (I)ntegral Tuning Parameter
extern float Kd;					// (D)erivative Tuning Parameter

extern float std_dev_v;
extern float std_dev_w;
//Temporary

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_TIM12_Init(void);
static void MX_I2C1_Init(void);
static void MX_TIM6_Init(void);

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);
                                

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/


void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim){
 if(htim->Instance == TIM6){ // Je¿eli przerwanie pochodzi od timera 6


	 for(rec_i = 0;rec_i<3;++rec_i)
		 	 temp_char[rec_i] = Received[rec_i+1];

//	 Kp = atoi(temp_char);
	 if (Received[0] == 80 || Received[0] == 112)	//P
		 Kp = atoi(temp_char);
	 if (Received[0] == 73 || Received[0] == 105)	//I
		 Ki = atoi(temp_char);
	 if (Received[0] == 68 || Received[0] == 100)	//D
		 Kd = atoi(temp_char);

	 //Temporary
	 Kp_t = Kp;                // (P)roportional Tuning Parameter
	 Ki_t = Ki;					// (I)ntegral Tuning Parameter
	 Kd_t = Kd;					// (D)erivative Tuning Parameter
//	 receive = atoi(Received);
//	 Ki = receive;


	 uint8_t str[50];
	 uint16_t size;
 //	  size = sprintf(str, "%d\r\n", HAL_GetTick());
 //	  HAL_UART_Transmit_IT(&huart3, str, size);


 	  TM_MPU6050_ReadAll(&MPU6050_Data0);
	  kal_result = kalman_filter_get_est(MPU6050_Data0.Accelerometer_X, MPU6050_Data0.Accelerometer_Z, MPU6050_Data0.Gyroscope_Y);
	  d_kal_result = kal_result;

	  angle = angle_before_kalman(MPU6050_Data0.Accelerometer_X, MPU6050_Data0.Accelerometer_Z);
	  d_angle = angle;

	  pid = PID_calculate(0,angle);
	  Control_Motor_by_PID(BOTH_MOTORS, pid);
  	  size = sprintf(str, "%d %d %d  %d  %d %d %d %d %d\r\n", Kp_t, Ki_t, Kd_t, pid, d_angle, d_kal_result, -100, 100, HAL_GetTick());
  	  HAL_UART_Transmit_IT(&huart3, str, size);


	 allow=1;
 }
}

/*
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart) {

 uint8_t Data[40]; // Tablica przechowujaca wysylana wiadomosc.
 uint16_t size = 0; // Rozmiar wysylanej wiadomosci

// size = sprintf(Data, "Odebrana wiadomosc: %s\n\r",Received);

 size = sprintf(Data, "%s\n\r",Received);

 HAL_UART_Transmit_IT(&huart3, Data, size); // Rozpoczecie nadawania danych z wykorzystaniem przerwan
 HAL_UART_Receive_IT(&huart3, Received, 1); // Ponowne w³¹czenie nas³uchiwania
}
*/
/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

