norbiciat04/hoverboard_STM32F469I-DISCO/hoverboard_firmware_sw4/Src/main.c
/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART3_UART_Init();
  MX_TIM12_Init();
  MX_I2C1_Init();
  MX_TIM6_Init();

  /* USER CODE BEGIN 2 */

  /*
//  __disable_irq();
  HX711 hx711 = {HX_SCK_GPIO_Port, HX_DATA_GPIO_Port, HX_SCK_Pin, HX_DATA_Pin, 0, 1};
  hx711 = HX711_Tare(hx711, 10);
  HX711_Init(hx711);
//  __enable_irq();
*/

  //uart example
  uint8_t i = 9;
  uint8_t data[50]; // Tablica przechowujaca wysylana wiadomosc.
  uint16_t size = 0; // Rozmiar wysylanej wiadomosci
  size = sprintf(data, "kutaczan %d\r\n", i); // Stworzenie wiadomosci do wyslania oraz przypisanie ilosci wysylanych znakow do zmiennej size.


  //BLDC_Motors Init
  Initialize_LR_Motors(&htim12, TIM_CHANNEL_1, TIM_CHANNEL_2);
  Stop_LR_Motors();


  //MPU6050 Init

 // TM_MPU6050_t MPU6050_Data0;
  TM_MPU6050_t MPU6050_Data1;
  uint8_t sensor1 = 0, sensor2 = 0;
  char str[120];

  // Initialize MPU6050 sensor 0, address = 0xD0, AD0 pin on sensor is low
  if (TM_MPU6050_Init(&MPU6050_Data0, TM_MPU6050_Device_0, TM_MPU6050_Accelerometer_8G, TM_MPU6050_Gyroscope_250s) == TM_MPU6050_Result_Ok) {
          // Display message to user
  //        TM_USART_Puts(USART1, "MPU6050 sensor 0 is ready to use!\n");
          size = sprintf(str, "MPU6050 sensor 0 is ready to use!\n", i);
  //  	  HAL_UART_Transmit(&huart3, str, size, 1000);
          // Sensor 1 OK
          sensor1 = 1;
  }

  // Initialize MPU6050 sensor 1, address = 0xD2, AD0 pin on sensor is high
  if (TM_MPU6050_Init(&MPU6050_Data1, TM_MPU6050_Device_1, TM_MPU6050_Accelerometer_8G, TM_MPU6050_Gyroscope_250s) == TM_MPU6050_Result_Ok) {
        // Display message to user
    //    TM_USART_Puts(USART1, "MPU6050 sensor 1 is ready to use!\n");
        size = sprintf(str, "MPU6050 sensor 1 is ready to use!\n", i);
 // 	  HAL_UART_Transmit(&huart3, str, size, 1000);
        // Sensor 2 OK
        sensor2 = 1;
  }







  //Kalman filter init
  TM_MPU6050_ReadAll(&MPU6050_Data0);
  kalman_filter_init(MPU6050_Data0.Accelerometer_X, MPU6050_Data0.Accelerometer_Z);


  //Init timer od wywo³ania pomiaru i PID
  HAL_TIM_Base_Start_IT(&htim6);


  int8_t last_v = 0;
    /*
    //program do wyznaczenia transmitancji

    HAL_Delay(1000);
    for (uint8_t i = 0;i<200;i++){

    	HAL_Delay(5);
  		TM_MPU6050_ReadAll(&MPU6050_Data0);
		kal_result = kalman_filter_get_est(MPU6050_Data0.Accelerometer_Y, MPU6050_Data0.Accelerometer_Z, MPU6050_Data0.Gyroscope_Z);
		d_kal_result = kal_result;

		angle = angle_before_kalman(MPU6050_Data0.Accelerometer_Y, MPU6050_Data0.Accelerometer_Z);
		d_angle = angle;
		size = sprintf(str, "%d %d\r\n", d_angle, d_kal_result);
		HAL_UART_Transmit_IT(&huart3, str, size);

  	  if (i==10)
  	  {
  		  Set_Left_Motor_DIR(FORWARD);
  		  Set_Right_Motor_DIR(FORWARD);
  		  Set_Left_Motor_Speed(20);
  		  Set_Right_Motor_Speed(20);
  	  }

  	  if (i>198)
  	  {
 // 		Set_Left_Motor_Speed(0);
  //		Set_Right_Motor_Speed(0);
//  		Set_LR_Motors_Speed(0,0);
  		Stop_LR_Motors();
  	  }

  	}

*/

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */


/*
 Struktura docelowa g³ównej pêtli:
 Pomiar MPU 1 i 2
 Filtracja 1 i 2 kalmanem
 Obliczenie PIDów dla 1 i 2
 Wysterowanie silników L i R za pomoc¹ wartoœci PIDów 1 i 2
 */

	  /*
	  //Pomiar tensometryczny
	  co++;
	  tenso = HX711_Value(hx711);
  	  size = sprintf(str, "%d %d\r\n", tenso, co);
  	  HAL_UART_Transmit_IT(&huart3, str, size);
  	  HAL_Delay(200);
	  */


  	  HAL_UART_Receive_IT(&huart3, Received, 4);

/*
	  if (allow ==1){
		 //Temporary
		 Kp_t = Kp;                // (P)roportional Tuning Parameter
		 Ki_t = Ki;					// (I)ntegral Tuning Parameter
		 Kd_t = Kd;					// (D)erivative Tuning Parameter
	  //Ma³y segway

	  	  TM_MPU6050_ReadAll(&MPU6050_Data0);
	  	  kal_result = kalman_filter_get_est(MPU6050_Data0.Accelerometer_X, MPU6050_Data0.Accelerometer_Z, MPU6050_Data0.Gyroscope_Y);
	  	  d_kal_result = kal_result;

		  angle = angle_before_kalman(MPU6050_Data0.Accelerometer_X, MPU6050_Data0.Accelerometer_Z);
		  d_angle = angle;

	  	  pid = PID_calculate(0,kal_result);
	  	  Control_Motor_by_PID(BOTH_MOTORS, pid);

	  	  size = sprintf(str, "%d %d %d  %d  %d %d %d %d %d\r\n", Kp_t, Ki_t, Kd_t, pid, d_angle, d_kal_result, -100, 100, HAL_GetTick());
	  	  HAL_UART_Transmit_IT(&huart3, str, size);
		  allow=0;
	   }
*/


	//  Control_Motor_by_PID(BOTH_MOTORS, 60);


/*
	  	  // obliczanie k¹ta i filtracja kalmanem
	       if (TM_DELAY_Time() >= 5) {
	           TM_DELAY_SetTime(0);
               TM_MPU6050_ReadAll(&MPU6050_Data0);


			   kal_result = kalman_filter_get_est(MPU6050_Data0.Accelerometer_X, MPU6050_Data0.Accelerometer_Z, MPU6050_Data0.Gyroscope_Y);
			   d_kal_result = kal_result;

			   angle = angle_before_kalman(MPU6050_Data0.Accelerometer_X, MPU6050_Data0.Accelerometer_Z);
			   d_angle = angle;
			   size = sprintf(str, "%d %d\r\n", d_angle, d_kal_result);
	//		   Set_Left_Motor_Speed(abs(d_kal_result));
	//		   Set_Right_Motor_Speed(abs(d_angle));
			   HAL_UART_Transmit_IT(&huart3, str, size);
	       }

*/



/*
      //Every 500ms
       if (TM_DELAY_Time() >= 500) {
           // Reset time
           TM_DELAY_SetTime(0);

           //vIf sensor 0 is connected
           if (sensor1) {
               // Read all data from sensor 0
               TM_MPU6050_ReadAll(&MPU6050_Data0);

               // Format data
               size = sprintf(str, "\r\n R \r\n 0 Acc: X:%d   Y:%d   Z:%d \r\n Gyr: X:%d   Y:%d   Z:%d \r\n Temp: %3.4f\r\n",
                   MPU6050_Data0.Accelerometer_X,
                   MPU6050_Data0.Accelerometer_Y,
                   MPU6050_Data0.Accelerometer_Z,
                   MPU6050_Data0.Gyroscope_X,
                   MPU6050_Data0.Gyroscope_Y,
                   MPU6050_Data0.Gyroscope_Z,
                   MPU6050_Data0.Temperature
               );

               // Show to usart
      //         TM_USART_Puts(USART1, str);
               HAL_UART_Transmit_IT(&huart3, str, size);
        //       HAL_UART_Transmit(&huart3, str, size, 500);
           }

           // If sensor 1 is connected
           if (sensor2) {
               // Read all data from sensor 1
               TM_MPU6050_ReadAll(&MPU6050_Data1);

